iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PRFTEN:1;
      uint64_t ICEN:1;
      uint64_t reservedSpace1:1;
      uint64_t ICRST:1;
      uint64_t reservedSpace2:3;
      uint64_t PES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2ACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOP:1;
      uint64_t OPERR:1;
      uint64_t reservedSpace0:1;
      uint64_t PROGERR:1;
      uint64_t WRPERR:1;
      uint64_t PGAERR:1;
      uint64_t SIZERR:1;
      uint64_t PGSERR:1;
      uint64_t MISSERR:1;
      uint64_t FASTERR:1;
      uint64_t reservedSpace1:4;
      uint64_t RDERR:1;
      uint64_t reservedSpace2:1;
      uint64_t BSY:1;
      uint64_t reservedSpace3:1;
      uint64_t CFGBSY:1;
      uint64_t PESD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:1;
      uint64_t PER:1;
      uint64_t MER:1;
      uint64_t PNB:8;
      uint64_t reservedSpace0:5;
      uint64_t STRT:1;
      uint64_t reservedSpace1:1;
      uint64_t FSTPG:1;
      uint64_t reservedSpace2:5;
      uint64_t EOPIE:1;
      uint64_t ERRIE:1;
      uint64_t RDERRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2CR;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFSA:8;
      uint64_t FSD:1;
      uint64_t reservedSpace0:3;
      uint64_t DDS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBRV:18;
      uint64_t SBRSA:5;
      uint64_t BRSD:1;
      uint64_t reservedSpace0:1;
      uint64_t SNBRSA:5;
      uint64_t NBRSD:1;
      uint64_t C2OPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRRVR;

};

#define Flash (*(volatile struct Flash_tag *) 0x58004000)

struct QUADSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t ABORT:1;
      uint64_t DMAEN:1;
      uint64_t TCEN:1;
      uint64_t SSHIFT:1;
      uint64_t reservedSpace0:3;
      uint64_t FTHRES:4;
      uint64_t reservedSpace1:4;
      uint64_t TEIE:1;
      uint64_t TCIE:1;
      uint64_t FTIE:1;
      uint64_t SMIE:1;
      uint64_t TOIE:1;
      uint64_t reservedSpace2:1;
      uint64_t APMS:1;
      uint64_t PMM:1;
      uint64_t PRESCALER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKMODE:1;
      uint64_t reservedSpace0:7;
      uint64_t CSHT:3;
      uint64_t reservedSpace1:5;
      uint64_t FSIZE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEF:1;
      uint64_t TCF:1;
      uint64_t FTF:1;
      uint64_t SMF:1;
      uint64_t TOF:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t FLEVEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEF:1;
      uint64_t CTCF:1;
      uint64_t reservedSpace0:1;
      uint64_t CSMF:1;
      uint64_t CTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRUCTION:8;
      uint64_t IMODE:2;
      uint64_t ADMODE:2;
      uint64_t ADSIZE:2;
      uint64_t ABMODE:2;
      uint64_t ABSIZE:2;
      uint64_t DCYC:5;
      uint64_t reservedSpace0:1;
      uint64_t DMODE:2;
      uint64_t FMODE:2;
      uint64_t SIOO:1;
      uint64_t reservedSpace1:2;
      uint64_t DDRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTERNATE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ABR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTR;

};

#define QUADSPI (*(volatile struct QUADSPI_tag *) 0xa0001000)

struct RCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSION:1;
      uint64_t MSIRDY:1;
      uint64_t MSIPLLEN:1;
      uint64_t reservedSpace0:1;
      uint64_t MSIRANGE:4;
      uint64_t HSION:1;
      uint64_t HSIKERON:1;
      uint64_t HSIRDY:1;
      uint64_t HSIASFS:1;
      uint64_t HSIKERDY:1;
      uint64_t reservedSpace1:3;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t CSSON:1;
      uint64_t HSEPRE:1;
      uint64_t reservedSpace2:3;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
      uint64_t PLLSAI1ON:1;
      uint64_t PLLSAI1RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSICAL:8;
      uint64_t MSITRIM:8;
      uint64_t HSICAL:8;
      uint64_t HSITRIM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:2;
      uint64_t SWS:2;
      uint64_t HPRE:4;
      uint64_t PPRE1:3;
      uint64_t PPRE2:3;
      uint64_t reservedSpace0:1;
      uint64_t STOPWUCK:1;
      uint64_t HPREF:1;
      uint64_t PPRE1F:1;
      uint64_t PPRE2F:1;
      uint64_t reservedSpace1:5;
      uint64_t MCOSEL:4;
      uint64_t MCOPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLSRC:2;
      uint64_t reservedSpace0:2;
      uint64_t PLLM:3;
      uint64_t reservedSpace1:1;
      uint64_t PLLN:7;
      uint64_t reservedSpace2:1;
      uint64_t PLLPEN:1;
      uint64_t PLLP:5;
      uint64_t reservedSpace3:2;
      uint64_t PLLQEN:1;
      uint64_t PLLQ:3;
      uint64_t PLLREN:1;
      uint64_t PLLR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PLLN:7;
      uint64_t reservedSpace1:1;
      uint64_t PLLPEN:1;
      uint64_t PLLP:5;
      uint64_t reservedSpace2:2;
      uint64_t PLLQEN:1;
      uint64_t PLLQ:3;
      uint64_t PLLREN:1;
      uint64_t PLLR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSAI1CFGR;

