iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSI1RDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t MSIRDYIE:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLRDYIE:1;
      uint64_t PLLSAI1RDYIE:1;
      uint64_t reservedSpace0:2;
      uint64_t LSECSSIE:1;
      uint64_t HSI48RDYIE:1;
      uint64_t LSI2RDYIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSI1RDYF:1;
      uint64_t LSERDYF:1;
      uint64_t MSIRDYF:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLRDYF:1;
      uint64_t PLLSAI1RDYF:1;
      uint64_t reservedSpace0:1;
      uint64_t HSECSSF:1;
      uint64_t LSECSSF:1;
      uint64_t HSI48RDYF:1;
      uint64_t LSI2RDYF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSI1RDYC:1;
      uint64_t LSERDYC:1;
      uint64_t MSIRDYC:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLRDYC:1;
      uint64_t PLLSAI1RDYC:1;
      uint64_t reservedSpace0:1;
      uint64_t HSECSSC:1;
      uint64_t LSECSSC:1;
      uint64_t HSI48RDYC:1;
      uint64_t LSI2RDYC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPSSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t SMPSDIV:2;
      uint64_t reservedSpace1:2;
      uint64_t SMPSSWS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1RST:1;
      uint64_t DMA2RST:1;
      uint64_t DMAMUXRST:1;
      uint64_t reservedSpace0:9;
      uint64_t CRCRST:1;
      uint64_t reservedSpace1:3;
      uint64_t TSCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOARST:1;
      uint64_t GPIOBRST:1;
      uint64_t GPIOCRST:1;
      uint64_t GPIODRST:1;
      uint64_t GPIOERST:1;
      uint64_t reservedSpace0:2;
      uint64_t GPIOHRST:1;
      uint64_t reservedSpace1:5;
      uint64_t ADCRST:1;
      uint64_t reservedSpace2:2;
      uint64_t AES1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t QSPIRST:1;
      uint64_t reservedSpace1:7;
      uint64_t PKARST:1;
      uint64_t AES2RST:1;
      uint64_t RNGRST:1;
      uint64_t HSEMRST:1;
      uint64_t IPCCRST:1;
      uint64_t reservedSpace2:4;
      uint64_t FLASHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3RSTR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t reservedSpace0:8;
      uint64_t LCDRST:1;
      uint64_t reservedSpace1:4;
      uint64_t SPI2RST:1;
      uint64_t reservedSpace2:6;
      uint64_t I2C1RST:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C3RST:1;
      uint64_t CRSRST:1;
      uint64_t reservedSpace4:1;
      uint64_t USBFSRST:1;
      uint64_t reservedSpace5:4;
      uint64_t LPTIM1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1RST:1;
      uint64_t reservedSpace0:4;
      uint64_t LPTIM2RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t TIM1RST:1;
      uint64_t SPI1RST:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1RST:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM16RST:1;
      uint64_t TIM17RST:1;
      uint64_t reservedSpace3:2;
      uint64_t SAI1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB3RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t DMAMUXEN:1;
      uint64_t reservedSpace0:9;
      uint64_t CRCEN:1;
      uint64_t reservedSpace1:3;
      uint64_t TSCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t reservedSpace0:2;
      uint64_t GPIOHEN:1;
      uint64_t reservedSpace1:5;
      uint64_t ADCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t AES1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t QSPIEN:1;
      uint64_t reservedSpace1:7;
      uint64_t PKAEN:1;
      uint64_t AES2EN:1;
      uint64_t RNGEN:1;
      uint64_t HSEMEN:1;
      uint64_t IPCCEN:1;
      uint64_t reservedSpace2:4;
      uint64_t FLASHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3ENR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t reservedSpace0:8;
      uint64_t LCDEN:1;
      uint64_t RTCAPBEN:1;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI2EN:1;
      uint64_t reservedSpace2:6;
      uint64_t I2C1EN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C3EN:1;
      uint64_t CRSEN:1;
      uint64_t reservedSpace4:1;
      uint64_t USBEN:1;
      uint64_t reservedSpace5:4;
      uint64_t LPTIM1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1EN:1;
      uint64_t reservedSpace0:4;
      uint64_t LPTIM2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t TIM1EN:1;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1EN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace3:2;
      uint64_t SAI1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

