iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1SMEN:1;
      uint64_t DMA2SMEN:1;
      uint64_t DMAMUXSMEN:1;
      uint64_t reservedSpace0:6;
      uint64_t SRAM1SMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCSMEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TSCSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB1SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOASMEN:1;
      uint64_t GPIOBSMEN:1;
      uint64_t GPIOCSMEN:1;
      uint64_t GPIODSMEN:1;
      uint64_t GPIOESMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t GPIOHSMEN:1;
      uint64_t reservedSpace1:5;
      uint64_t ADCFSSMEN:1;
      uint64_t reservedSpace2:2;
      uint64_t AES1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB2SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t QSPISMEN:1;
      uint64_t reservedSpace1:7;
      uint64_t PKASMEN:1;
      uint64_t AES2SMEN:1;
      uint64_t RNGSMEN:1;
      uint64_t reservedSpace2:5;
      uint64_t SRAM2SMEN:1;
      uint64_t FLASHSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB3SMENR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2SMEN:1;
      uint64_t reservedSpace0:8;
      uint64_t LCDSMEN:1;
      uint64_t RTCAPBSMEN:1;
      uint64_t WWDGSMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SPI2SMEN:1;
      uint64_t reservedSpace2:6;
      uint64_t I2C1SMEN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C3SMEN:1;
      uint64_t CRSMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t USBSMEN:1;
      uint64_t reservedSpace5:4;
      uint64_t LPTIM1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1SMENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1SMEN:1;
      uint64_t reservedSpace0:4;
      uint64_t LPTIM2SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1SMENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t TIM1SMEN:1;
      uint64_t SPI1SMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1SMEN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM16SMEN:1;
      uint64_t TIM17SMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SAI1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2SMENR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART1SEL:2;
      uint64_t reservedSpace0:8;
      uint64_t LPUART1SEL:2;
      uint64_t I2C1SEL:2;
      uint64_t reservedSpace1:2;
      uint64_t I2C3SEL:2;
      uint64_t LPTIM1SEL:2;
      uint64_t LPTIM2SEL:2;
      uint64_t SAI1SEL:2;
      uint64_t reservedSpace2:2;
      uint64_t CLK48SEL:2;
      uint64_t ADCSEL:2;
      uint64_t RNGSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCIPR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t LSEDRV:2;
      uint64_t LSECSSON:1;
      uint64_t LSECSSD:1;
      uint64_t reservedSpace0:1;
      uint64_t RTCSEL:2;
      uint64_t reservedSpace1:5;
      uint64_t RTCEN:1;
      uint64_t BDRST:1;
      uint64_t reservedSpace2:7;
      uint64_t LSCOEN:1;
      uint64_t LSCOSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSI1ON:1;
      uint64_t LSI1RDY:1;
      uint64_t LSI2ON:1;
      uint64_t LSI2RDY:1;
      uint64_t LSI2TRIMEN:1;
      uint64_t LSI2TRIMOK:1;
      uint64_t reservedSpace0:2;
      uint64_t LSI2BW:4;
      uint64_t reservedSpace1:2;
      uint64_t RFWKPSEL:2;
      uint64_t RFRSTS:1;
      uint64_t reservedSpace2:6;
      uint64_t RMVF:1;
      uint64_t reservedSpace3:1;
      uint64_t OBLRSTF:1;
      uint64_t PINRSTF:1;
      uint64_t BORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t IWDGRSTF:1;
      uint64_t WWDGRSTF:1;
      uint64_t LPWRRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSI48ON:1;
      uint64_t HSI48RDY:1;
      uint64_t reservedSpace0:5;
      uint64_t HSI48CAL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UNLOCKED:1;
      uint64_t reservedSpace0:2;
      uint64_t HSES:1;
      uint64_t HSEGMC:3;
      uint64_t reservedSpace1:1;
      uint64_t HSETUNE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSECR;

  uint8_t res7[104];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHDHPRE:4;
      uint64_t C2HPRE:4;
      uint64_t reservedSpace0:8;
      uint64_t SHDHPREF:1;
      uint64_t C2HPREF:1;
      uint64_t reservedSpace1:2;
      uint64_t RFCSS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTCFGR;

  uint8_t res8[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t DMAMUXEN:1;
      uint64_t reservedSpace0:6;
      uint64_t SRAM1EN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TSCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2AHB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOAEN:1;
      uint64_t GPIOBEN:1;
      uint64_t GPIOCEN:1;
      uint64_t GPIODEN:1;
      uint64_t GPIOEEN:1;
      uint64_t reservedSpace0:2;
      uint64_t GPIOHEN:1;
      uint64_t reservedSpace1:5;
      uint64_t ADCEN:1;
      uint64_t reservedSpace2:2;
      uint64_t AES1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2AHB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PKAEN:1;
      uint64_t AES2EN:1;
      uint64_t RNGEN:1;
      uint64_t HSEMEN:1;
      uint64_t IPCCEN:1;
      uint64_t reservedSpace1:4;
      uint64_t FLASHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2AHB3ENR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t reservedSpace0:8;
      uint64_t LCDEN:1;
      uint64_t RTCAPBEN:1;
      uint64_t reservedSpace1:3;
      uint64_t SPI2EN:1;
      uint64_t reservedSpace2:6;
      uint64_t I2C1EN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C3EN:1;
      uint64_t CRSEN:1;
      uint64_t reservedSpace4:1;
      uint64_t USBEN:1;
      uint64_t reservedSpace5:4;
      uint64_t LPTIM1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB1ENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1EN:1;
      uint64_t reservedSpace0:4;
      uint64_t LPTIM2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB1ENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t TIM1EN:1;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1EN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace3:2;
      uint64_t SAI1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLEEN:1;
      uint64_t EN802:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB3ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1SMEN:1;
      uint64_t DMA2SMEN:1;
      uint64_t DMAMUXSMEN:1;
      uint64_t reservedSpace0:6;
      uint64_t SRAM1SMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCSMEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TSCSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2AHB1SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOASMEN:1;
      uint64_t GPIOBSMEN:1;
      uint64_t GPIOCSMEN:1;
      uint64_t GPIODSMEN:1;
      uint64_t GPIOESMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t GPIOHSMEN:1;
      uint64_t reservedSpace1:5;
      uint64_t ADCFSSMEN:1;
      uint64_t reservedSpace2:2;
      uint64_t AES1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2AHB2SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PKASMEN:1;
      uint64_t AES2SMEN:1;
      uint64_t RNGSMEN:1;
      uint64_t reservedSpace1:5;
      uint64_t SRAM2SMEN:1;
      uint64_t FLASHSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2AHB3SMENR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2SMEN:1;
      uint64_t reservedSpace0:8;
      uint64_t LCDSMEN:1;
      uint64_t RTCAPBSMEN:1;
      uint64_t reservedSpace1:3;
      uint64_t SPI2SMEN:1;
      uint64_t reservedSpace2:6;
      uint64_t I2C1SMEN:1;
      uint64_t reservedSpace3:1;
      uint64_t I2C3SMEN:1;
      uint64_t CRSMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t USBSMEN:1;
      uint64_t reservedSpace5:4;
      uint64_t LPTIM1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB1SMENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPUART1SMEN:1;
      uint64_t reservedSpace0:4;
      uint64_t LPTIM2SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB1SMENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t TIM1SMEN:1;
      uint64_t SPI1SMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1SMEN:1;
      uint64_t reservedSpace2:2;
      uint64_t TIM16SMEN:1;
      uint64_t TIM17SMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SAI1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB2SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLESMEN:1;
      uint64_t SMEN802:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2APB3SMENR;

