iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
};

#define RCC (*(volatile struct RCC_tag *) 0x58000000)

struct PWR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPMS:3;
      uint64_t reservedSpace0:1;
      uint64_t FPDR:1;
      uint64_t FPDS:1;
      uint64_t reservedSpace1:2;
      uint64_t DBP:1;
      uint64_t VOS:2;
      uint64_t reservedSpace2:3;
      uint64_t LPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t PVME1:1;
      uint64_t reservedSpace0:1;
      uint64_t PVME3:1;
      uint64_t reservedSpace1:3;
      uint64_t USV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWUP1:1;
      uint64_t EWUP2:1;
      uint64_t EWUP3:1;
      uint64_t EWUP4:1;
      uint64_t EWUP5:1;
      uint64_t reservedSpace0:3;
      uint64_t EBORHSDFB:1;
      uint64_t RRS:1;
      uint64_t APC:1;
      uint64_t EBLEA:1;
      uint64_t ECRPE:1;
      uint64_t E802A:1;
      uint64_t EC2H:1;
      uint64_t EIWUL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WP1:1;
      uint64_t WP2:1;
      uint64_t WP3:1;
      uint64_t WP4:1;
      uint64_t WP5:1;
      uint64_t reservedSpace0:3;
      uint64_t VBE:1;
      uint64_t VBRS:1;
      uint64_t reservedSpace1:5;
      uint64_t C2BOOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWUF1:1;
      uint64_t CWUF2:1;
      uint64_t CWUF3:1;
      uint64_t CWUF4:1;
      uint64_t CWUF5:1;
      uint64_t reservedSpace0:2;
      uint64_t SDFBF:1;
      uint64_t BORHF:1;
      uint64_t BLEWUF:1;
      uint64_t WUF802:1;
      uint64_t CRPEF:1;
      uint64_t BLEAF:1;
      uint64_t AF802:1;
      uint64_t C2HF:1;
      uint64_t WUFI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDBF:1;
      uint64_t SDSMPSF:1;
      uint64_t reservedSpace0:6;
      uint64_t REGLPS:1;
      uint64_t REGLPF:1;
      uint64_t VOSF:1;
      uint64_t PVDO:1;
      uint64_t PVMO1:1;
      uint64_t reservedSpace1:1;
      uint64_t PVMO3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWUF1:1;
      uint64_t CWUF2:1;
      uint64_t CWUF3:1;
      uint64_t CWUF4:1;
      uint64_t CWUF5:1;
      uint64_t reservedSpace0:2;
      uint64_t CSMPSFBF:1;
      uint64_t CBORHF:1;
      uint64_t CBLEWUF:1;
      uint64_t C802WUF:1;
      uint64_t CCRPEF:1;
      uint64_t CBLEAF:1;
      uint64_t C802AF:1;
      uint64_t CC2HF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDVOS:4;
      uint64_t SDSC:3;
      uint64_t reservedSpace0:1;
      uint64_t BORHC:1;
      uint64_t SMPSCFG:1;
      uint64_t reservedSpace1:4;
      uint64_t SDBEN:1;
      uint64_t SDEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t reservedSpace0:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t reservedSpace0:1;
      uint64_t PD14:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t reservedSpace0:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
      uint64_t PU5:1;
      uint64_t PU6:1;
      uint64_t PU7:1;
      uint64_t PU8:1;
      uint64_t PU9:1;
      uint64_t PU10:1;
      uint64_t PU11:1;
      uint64_t PU12:1;
      uint64_t PU13:1;
      uint64_t PU14:1;
      uint64_t PU15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
      uint64_t PD5:1;
      uint64_t PD6:1;
      uint64_t PD7:1;
      uint64_t PD8:1;
      uint64_t PD9:1;
      uint64_t PD10:1;
      uint64_t PD11:1;
      uint64_t PD12:1;
      uint64_t PD13:1;
      uint64_t PD14:1;
      uint64_t PD15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t PU2:1;
      uint64_t PU3:1;
      uint64_t PU4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t PD2:1;
      uint64_t PD3:1;
      uint64_t PD4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRE;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PU0:1;
      uint64_t PU1:1;
      uint64_t reservedSpace0:1;
      uint64_t PU3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUCRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD0:1;
      uint64_t PD1:1;
      uint64_t reservedSpace0:1;
      uint64_t PD3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCRH;

  uint8_t res1[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPMS:3;
      uint64_t reservedSpace0:1;
      uint64_t FPDR:1;
      uint64_t FPDS:1;
      uint64_t reservedSpace1:8;
      uint64_t BLEEWKUP:1;
      uint64_t EWKUP802:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWUP1:1;
      uint64_t EWUP2:1;
      uint64_t EWUP3:1;
      uint64_t EWUP4:1;
      uint64_t EWUP5:1;
      uint64_t reservedSpace0:4;
      uint64_t EBLEWUP:1;
      uint64_t E802WUP:1;
      uint64_t reservedSpace1:1;
      uint64_t APC:1;
      uint64_t reservedSpace2:2;
      uint64_t EIWUL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2CR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t C1CSSF:1;
      uint64_t C2CSSF:1;
      uint64_t CCRPF:1;
      uint64_t reservedSpace0:5;
      uint64_t C1SBF:1;
      uint64_t C1STOPF:1;
      uint64_t C2SBF:1;
      uint64_t C2STOPF:1;
      uint64_t reservedSpace1:1;
      uint64_t CRPF:1;
      uint64_t C1DS:1;
      uint64_t C2DS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTSCR;

