iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
};

#define PWR (*(volatile struct PWR_tag *) 0x58000400)

struct SYSCFG_VREFBUF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEM_MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_MEMRMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t BOOSTEN:1;
      uint64_t reservedSpace1:7;
      uint64_t I2C_PB6_FMP:1;
      uint64_t I2C_PB7_FMP:1;
      uint64_t I2C_PB8_FMP:1;
      uint64_t I2C_PB9_FMP:1;
      uint64_t I2C1_FMP:1;
      uint64_t reservedSpace2:1;
      uint64_t I2C3_FMP:1;
      uint64_t reservedSpace3:3;
      uint64_t FPU_IE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI0:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI1:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI2:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_EXTICR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI4:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI5:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI6:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_EXTICR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI8:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI9:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI10:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI11:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_EXTICR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTI12:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTI13:3;
      uint64_t reservedSpace1:1;
      uint64_t EXTI14:3;
      uint64_t reservedSpace2:1;
      uint64_t EXTI15:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_EXTICR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM2ER:1;
      uint64_t SRAM2BSY:1;
      uint64_t reservedSpace0:29;
      uint64_t C2RFD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_SCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLL:1;
      uint64_t SPL:1;
      uint64_t PVDL:1;
      uint64_t ECCL:1;
      uint64_t reservedSpace0:4;
      uint64_t SPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0WP:1;
      uint64_t P1WP:1;
      uint64_t P2WP:1;
      uint64_t P3WP:1;
      uint64_t P4WP:1;
      uint64_t P5WP:1;
      uint64_t P6WP:1;
      uint64_t P7WP:1;
      uint64_t P8WP:1;
      uint64_t P9WP:1;
      uint64_t P10WP:1;
      uint64_t P11WP:1;
      uint64_t P12WP:1;
      uint64_t P13WP:1;
      uint64_t P14WP:1;
      uint64_t P15WP:1;
      uint64_t P16WP:1;
      uint64_t P17WP:1;
      uint64_t P18WP:1;
      uint64_t P19WP:1;
      uint64_t P20WP:1;
      uint64_t P21WP:1;
      uint64_t P22WP:1;
      uint64_t P23WP:1;
      uint64_t P24WP:1;
      uint64_t P25WP:1;
      uint64_t P26WP:1;
      uint64_t P27WP:1;
      uint64_t P28WP:1;
      uint64_t P29WP:1;
      uint64_t P30WP:1;
      uint64_t P31WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_SWPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_SKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P32WP:1;
      uint64_t P33WP:1;
      uint64_t P34WP:1;
      uint64_t P35WP:1;
      uint64_t P36WP:1;
      uint64_t P37WP:1;
      uint64_t P38WP:1;
      uint64_t P39WP:1;
      uint64_t P40WP:1;
      uint64_t P41WP:1;
      uint64_t P42WP:1;
      uint64_t P43WP:1;
      uint64_t P44WP:1;
      uint64_t P45WP:1;
      uint64_t P46WP:1;
      uint64_t P47WP:1;
      uint64_t P48WP:1;
      uint64_t P49WP:1;
      uint64_t P50WP:1;
      uint64_t P51WP:1;
      uint64_t P52WP:1;
      uint64_t P53WP:1;
      uint64_t P54WP:1;
      uint64_t P55WP:1;
      uint64_t P56WP:1;
      uint64_t P57WP:1;
      uint64_t P58WP:1;
      uint64_t P59WP:1;
      uint64_t P60WP:1;
      uint64_t P61WP:1;
      uint64_t P62WP:1;
      uint64_t P63WP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_SWPR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENVR:1;
      uint64_t HIZ:1;
      uint64_t VRS:1;
      uint64_t VRR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFBUF_CCR;

  uint8_t res1[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t TIM1IM:1;
      uint64_t TIM16IM:1;
      uint64_t TIM17IM:1;
      uint64_t reservedSpace1:5;
      uint64_t EXIT5IM:1;
      uint64_t EXIT6IM:1;
      uint64_t EXIT7IM:1;
      uint64_t EXIT8IM:1;
      uint64_t EXIT9IM:1;
      uint64_t EXIT10IM:1;
      uint64_t EXIT11IM:1;
      uint64_t EXIT12IM:1;
      uint64_t EXIT13IM:1;
      uint64_t EXIT14IM:1;
      uint64_t EXIT15IM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_IMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PVM1IM:1;
      uint64_t reservedSpace1:1;
      uint64_t PVM3IM:1;
      uint64_t reservedSpace2:1;
      uint64_t PVDIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_IMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCSTAMP:1;
      uint64_t reservedSpace0:2;
      uint64_t RTCWKUP:1;
      uint64_t RTCALARM:1;
      uint64_t RCC_bitfield:1;
      uint64_t FLASH:1;
      uint64_t reservedSpace1:1;
      uint64_t PKA_bitfield:1;
      uint64_t RNG_bitfield:1;
      uint64_t AES1_bitfield:1;
      uint64_t COMP_bitfield:1;
      uint64_t ADC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_C2IMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA1_CH1_IM:1;
      uint64_t DMA1_CH2_IM:1;
      uint64_t DMA1_CH3_IM:1;
      uint64_t DMA1_CH4_IM:1;
      uint64_t DMA1_CH5_IM:1;
      uint64_t DMA1_CH6_IM:1;
      uint64_t DMA1_CH7_IM:1;
      uint64_t reservedSpace0:1;
      uint64_t DMA2_CH1_IM:1;
      uint64_t DMA2_CH2_IM:1;
      uint64_t DMA2_CH3_IM:1;
      uint64_t DMA2_CH4_IM:1;
      uint64_t DMA2_CH5_IM:1;
      uint64_t DMA2_CH6_IM:1;
      uint64_t DMA2_CH7_IM:1;
      uint64_t DMAM_UX1_IM:1;
      uint64_t PVM1IM:1;
      uint64_t reservedSpace1:1;
      uint64_t PVM3IM:1;
      uint64_t reservedSpace2:1;
      uint64_t PVDIM:1;
      uint64_t TSCIM:1;
      uint64_t LCDIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_C2IMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAES1:1;
      uint64_t SAES2:1;
      uint64_t SPKA:1;
      uint64_t SRNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCFG_SIPCR;

