iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
};

#define SYSCFG_VREFBUF (*(volatile struct SYSCFG_VREFBUF_tag *) 0x40010000)

struct COMP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP1_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP1_PWRMODE:2;
      uint64_t COMP1_INMSEL:3;
      uint64_t COMP1_INPSEL:2;
      uint64_t reservedSpace1:6;
      uint64_t COMP1_POLARITY:1;
      uint64_t COMP1_HYST:2;
      uint64_t COMP1_BLANKING:3;
      uint64_t reservedSpace2:1;
      uint64_t COMP1_BRGEN:1;
      uint64_t COMP1_SCALEN:1;
      uint64_t reservedSpace3:1;
      uint64_t COMP1_INMESEL:2;
      uint64_t reservedSpace4:3;
      uint64_t COMP1_VALUE:1;
      uint64_t COMP1_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP1_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMP2_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t COMP2_PWRMODE:2;
      uint64_t COMP2_INMSEL:2;
      uint64_t reservedSpace1:1;
      uint64_t COMP2_INPSEL:2;
      uint64_t COMP2_WINMODE:1;
      uint64_t reservedSpace2:5;
      uint64_t COMP2_POLARITY:1;
      uint64_t COMP2_HYST:2;
      uint64_t COMP2_BLANKING:3;
      uint64_t reservedSpace3:1;
      uint64_t COMP2_BRGEN:1;
      uint64_t COMP2_SCALEN:1;
      uint64_t reservedSpace4:1;
      uint64_t COMP2_INMESEL:2;
      uint64_t reservedSpace5:3;
      uint64_t COMP2_VALUE:1;
      uint64_t COMP2_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMP2_CSR;

};

#define COMP (*(volatile struct COMP_tag *) 0x40010200)

struct RNG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RNGEN:1;
      uint64_t IE:1;
      uint64_t reservedSpace1:2;
      uint64_t BYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRDY:1;
      uint64_t CECS:1;
      uint64_t SECS:1;
      uint64_t reservedSpace0:2;
      uint64_t CEIS:1;
      uint64_t SEIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RNDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

};

#define RNG (*(volatile struct RNG_tag *) 0x58001000)

struct AES1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t DATATYPE:2;
      uint64_t MODE:2;
      uint64_t CHMOD10:2;
      uint64_t CCFC:1;
      uint64_t ERRC:1;
      uint64_t CCFIE:1;
      uint64_t ERRIE:1;
      uint64_t DMAINEN:1;
      uint64_t DMAOUTEN:1;
      uint64_t GCMPH:2;
      uint64_t reservedSpace0:1;
      uint64_t CHMOD2:1;
      uint64_t reservedSpace1:1;
      uint64_t KEYSIZE:1;
      uint64_t reservedSpace2:1;
      uint64_t NPBLB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCF:1;
      uint64_t RDERR:1;
      uint64_t WRERR:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DINR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DOUTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP0R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP1R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP2R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP3R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP4R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP5R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP5R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP6R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP6R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP7R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP7R;

  uint8_t res0[912];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG1:4;
      uint64_t CFG2:4;
      uint64_t CFG3:4;
      uint64_t CFG4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDR;

