iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
};

#define AES1 (*(volatile struct AES1_tag *) 0x50060000)

struct AES2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t DATATYPE:2;
      uint64_t MODE:2;
      uint64_t CHMOD10:2;
      uint64_t CCFC:1;
      uint64_t ERRC:1;
      uint64_t CCFIE:1;
      uint64_t ERRIE:1;
      uint64_t DMAINEN:1;
      uint64_t DMAOUTEN:1;
      uint64_t GCMPH:2;
      uint64_t reservedSpace0:1;
      uint64_t CHMOD2:1;
      uint64_t reservedSpace1:1;
      uint64_t KEYSIZE:1;
      uint64_t reservedSpace2:1;
      uint64_t NPBLB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCF:1;
      uint64_t RDERR:1;
      uint64_t WRERR:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DINR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DINR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_DOUTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_IVR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IVR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_KEYR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP0R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP1R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP2R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP3R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP3R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP4R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP4R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP5R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP5R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP6R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP6R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_SUSP7R:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUSP7R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG1:4;
      uint64_t CFG2:4;
      uint64_t CFG3:4;
      uint64_t CFG4:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDR;

};

#define AES2 (*(volatile struct AES2_tag *) 0x58001800)

struct HSEM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) R31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROCID:8;
      uint64_t COREID:4;
      uint64_t reservedSpace0:19;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1IER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISCm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISFm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISFm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1MISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2IER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISCm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISFm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISFm:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2MISR;

