iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
};

#define SAI1 (*(volatile struct SAI1_tag *) 0x40015400)

struct TIM17_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UDIS:1;
      uint64_t URS:1;
      uint64_t OPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARPE:1;
      uint64_t CKD:2;
      uint64_t reservedSpace1:1;
      uint64_t UIFREMAP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCPC:1;
      uint64_t reservedSpace0:1;
      uint64_t CCUS:1;
      uint64_t CCDS:1;
      uint64_t reservedSpace1:4;
      uint64_t OIS1:1;
      uint64_t OIS1N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKINE:1;
      uint64_t BKCMP1E:1;
      uint64_t BKCMP2E:1;
      uint64_t reservedSpace0:6;
      uint64_t BKINP:1;
      uint64_t BKCMP1P:1;
      uint64_t BKCMP2P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIF:1;
      uint64_t CC1IF:1;
      uint64_t reservedSpace0:3;
      uint64_t COMIF:1;
      uint64_t TIF:1;
      uint64_t BIF:1;
      uint64_t reservedSpace1:1;
      uint64_t CC1OF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UG:1;
      uint64_t CC1G:1;
      uint64_t reservedSpace0:3;
      uint64_t COMG:1;
      uint64_t TG:1;
      uint64_t BG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC1S:2;
      uint64_t OC1FE:1;
      uint64_t OC1PE:1;
      uint64_t OC1M:3;
      uint64_t reservedSpace0:9;
      uint64_t OC1M_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMR1_Output;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC1S:2;
      uint64_t IC1PSC:2;
      uint64_t IC1F:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMR1_Input;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC1E:1;
      uint64_t CC1P:1;
      uint64_t CC1NE:1;
      uint64_t CC1NP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
      uint64_t reservedSpace0:15;
      uint64_t UIFCPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCR1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTG:8;
      uint64_t LOCK:2;
      uint64_t OSSI:1;
      uint64_t OSSR:1;
      uint64_t BKE:1;
      uint64_t BKP:1;
      uint64_t AOE:1;
      uint64_t MOE:1;
      uint64_t BKF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBA:5;
      uint64_t reservedSpace0:3;
      uint64_t DBL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI1_RMP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BKINE:1;
      uint64_t BKCMP1E:1;
      uint64_t BKCMP2E:1;
      uint64_t reservedSpace0:6;
      uint64_t BKINP:1;
      uint64_t BKCMP1P:1;
      uint64_t BKCMP2P:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AF1;

};

#define TIM17 (*(volatile struct TIM17_tag *) 0x40014800)

struct LPTIM1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPM:1;
      uint64_t ARRM:1;
      uint64_t EXTTRIG:1;
      uint64_t CMPOK:1;
      uint64_t ARROK:1;
      uint64_t UP:1;
      uint64_t DOWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMCF:1;
      uint64_t ARRMCF:1;
      uint64_t EXTTRIGCF:1;
      uint64_t CMPOKCF:1;
      uint64_t ARROKCF:1;
      uint64_t UPCF:1;
      uint64_t DOWNCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMIE:1;
      uint64_t ARRMIE:1;
      uint64_t EXTTRIGIE:1;
      uint64_t CMPOKIE:1;
      uint64_t ARROKIE:1;
      uint64_t UPIE:1;
      uint64_t DOWNIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKSEL:1;
      uint64_t CKPOL:2;
      uint64_t CKFLT:2;
      uint64_t reservedSpace0:1;
      uint64_t TRGFLT:2;
      uint64_t reservedSpace1:1;
      uint64_t PRESC:3;
      uint64_t reservedSpace2:1;
      uint64_t TRIGSEL:3;
      uint64_t reservedSpace3:1;
      uint64_t TRIGEN:2;
      uint64_t TIMOUT:1;
      uint64_t WAVE:1;
      uint64_t WAVPOL:1;
      uint64_t PRELOAD:1;
      uint64_t COUNTMODE:1;
      uint64_t ENC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SNGSTRT:1;
      uint64_t CNTSTRT:1;
      uint64_t COUNTRST:1;
      uint64_t RSTARE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OR1:1;
      uint64_t OR2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OR;

