iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32WB55/targetInit/M4/STM32WB55_sfr.h
};

#define RTC (*(volatile struct RTC_tag *) 0x40002800)

struct PKA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t START:1;
      uint64_t SECLVL:1;
      uint64_t reservedSpace0:5;
      uint64_t MODE:6;
      uint64_t reservedSpace1:3;
      uint64_t PROCENDIE:1;
      uint64_t reservedSpace2:1;
      uint64_t RAMERRIE:1;
      uint64_t ADDRERRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t BUSY:1;
      uint64_t PROCENDF:1;
      uint64_t reservedSpace1:1;
      uint64_t RAMERRF:1;
      uint64_t ADDRERRF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t PROCENDFC:1;
      uint64_t reservedSpace1:1;
      uint64_t RAMERRFC:1;
      uint64_t ADDRERRFC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLRFR;

  uint8_t res0[8168];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDR;

};

#define PKA (*(volatile struct PKA_tag *) 0x58002000)

struct IPCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOIE:1;
      uint64_t reservedSpace0:15;
      uint64_t TXFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1OM:1;
      uint64_t CH2OM:1;
      uint64_t CH3OM:1;
      uint64_t CH4OM:1;
      uint64_t CH5OM:1;
      uint64_t CH6OM:1;
      uint64_t reservedSpace0:10;
      uint64_t CH1FM:1;
      uint64_t CH2FM:1;
      uint64_t CH3FM:1;
      uint64_t CH4FM:1;
      uint64_t CH5FM:1;
      uint64_t CH6FM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1C:1;
      uint64_t CH2C:1;
      uint64_t CH3C:1;
      uint64_t CH4C:1;
      uint64_t CH5C:1;
      uint64_t CH6C:1;
      uint64_t reservedSpace0:10;
      uint64_t CH1S:1;
      uint64_t CH2S:1;
      uint64_t CH3S:1;
      uint64_t CH4S:1;
      uint64_t CH5S:1;
      uint64_t CH6S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t CH4F:1;
      uint64_t CH5F:1;
      uint64_t CH6F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1TO2SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOIE:1;
      uint64_t reservedSpace0:15;
      uint64_t TXFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1OM:1;
      uint64_t CH2OM:1;
      uint64_t CH3OM:1;
      uint64_t CH4OM:1;
      uint64_t CH5OM:1;
      uint64_t CH6OM:1;
      uint64_t reservedSpace0:10;
      uint64_t CH1FM:1;
      uint64_t CH2FM:1;
      uint64_t CH3FM:1;
      uint64_t CH4FM:1;
      uint64_t CH5FM:1;
      uint64_t CH6FM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1C:1;
      uint64_t CH2C:1;
      uint64_t CH3C:1;
      uint64_t CH4C:1;
      uint64_t CH5C:1;
      uint64_t CH6C:1;
      uint64_t reservedSpace0:10;
      uint64_t CH1S:1;
      uint64_t CH2S:1;
      uint64_t CH3S:1;
      uint64_t CH4S:1;
      uint64_t CH5S:1;
      uint64_t CH6S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t CH4F:1;
      uint64_t CH5F:1;
      uint64_t CH6F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2TOC1SR;

  uint8_t res0[976];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNELS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINREV:4;
      uint64_t MAJREV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIDR;

};

#define IPCC (*(volatile struct IPCC_tag *) 0x58000c00)

struct EXTI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RT:22;
      uint64_t reservedSpace0:9;
      uint64_t RT_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FT:22;
      uint64_t reservedSpace0:9;
      uint64_t FT_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWI:22;
      uint64_t reservedSpace0:9;
      uint64_t SWI_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIF:22;
      uint64_t reservedSpace0:9;
      uint64_t PIF_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR1;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RT33:1;
      uint64_t reservedSpace1:6;
      uint64_t RT40_41:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FT33:1;
      uint64_t reservedSpace1:6;
      uint64_t FT40_41:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SWI33:1;
      uint64_t reservedSpace1:6;
      uint64_t SWI40_41:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PIF33:1;
      uint64_t reservedSpace1:6;
      uint64_t PIF40_41:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR2;

  uint8_t res1[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1IMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0_15:16;
      uint64_t reservedSpace0:1;
      uint64_t EM17_21:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1EMR1;

